Autodesk.Revit.DB.MassInstanceUtils.GetJoinedElementIds(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Get the ElementIds of Elements that are joined to a mass instance.
document:
The Document.
massInstanceId:
The ElementId of the mass instance.
Returns:
ElementIds of Elements joined to the mass instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The ElementId massInstanceId is not a mass instance.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.MassInstanceUtils.GetGrossVolume(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Get the total building volume represented by a mass instance.
document:
The Document.
massInstanceId:
The ElementId of the mass instance.
Returns:
The gross volume in cubic feet.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The ElementId massInstanceId is not a mass instance.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.MassInstanceUtils.GetGrossSurfaceArea(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Get the total exterior building surface area represented by a mass instance.
document:
The Document.
massInstanceId:
The ElementId of the mass instance.
Returns:
The gross surface area in square feet.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The ElementId massInstanceId is not a mass instance.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.MassInstanceUtils.GetGrossFloorArea(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Get the total occupiable floor area represented by a mass instance.
Remarks:
The area is computed from the cross sections that are created by intersecting the
associated Levels with the mass instance Geometry.
document:
The Document.
massInstanceId:
The ElementId of the mass instance.
Returns:
The gross floor area in square feet.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The ElementId massInstanceId is not a mass instance.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.MassInstanceUtils.GetMassLevelIds(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Get the ElementIds of the Levels associated with a mass instance.
document:
The Document.
massInstanceId:
The ElementId of the mass instance.
Returns:
The ElementIds of the Levels
Throws Autodesk.Revit.Exceptions.ArgumentException:
The ElementId massInstanceId is not a mass instance.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.MassInstanceUtils.GetMassLevelDataIds(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Get the ElementIds of the MassLevelDatas (Mass Floors) associated with a mass instance.
document:
The Document.
massInstanceId:
The ElementId of the mass instance.
Returns:
The ElementIds of the MassLevelDatas.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The ElementId massInstanceId is not a mass instance.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.MassInstanceUtils.RemoveMassLevelDataFromMassInstance(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Delete the MassLevelData (Mass Floor) that associates a Level with a mass instance.
Remarks:
Alternatively, you could just delete the MassLevelData.
document:
The Document.
massInstanceId:
The ElementId of the mass instance.
levelId:
The ElementId of the Level to disassociate from the mass instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The ElementId massInstanceId is not a mass instance.
-or-
The ElementId levelId is not a Level.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.MassInstanceUtils.AddMassLevelDataToMassInstance(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Create a MassLevelData (Mass Floor) to associate a Level with a mass instance.
document:
The Document.
massInstanceId:
The ElementId of the mass instance.
levelId:
The ElementId of the Level to associate with the mass instance.
Returns:
The ElementId of the MassLevelData that was created, or the existing ElementId if it was already in added.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The ElementId massInstanceId is not a mass instance.
-or-
The ElementId levelId is not a Level.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012